"""
Дана строка. Выполните преобразования над ней.
"""

s = '  svGHytr  TYUijthHG  '

# Подсчитайте количество символов t в строке
# напишите решение здесь

# Проверьте входит ли подстрока 'tyu' в строку


# Проверьте, состоит ли строка только из заглавных букв


# Удалите пробелы до и после слов строки


# * Удалите все пробелы из строки и сделайте первую букву заглавной


# ** Дана строчная латинская буква, переведите ее в заглавную без использования втрокового метода

# ** Cложите строку «5» и число 5. Чтобы на выходе получилось число. Не используя операция int().