"""
Напишите функцию Python для печати словаря, в котором ключи - это числа от 1 до n (оба включены), а значения - куб ключей.

"""
def cube_dict(num: int) -> dict:
    pass

"""
Напишите функцию на Python для суммирования всех элементов в словаре. 
"""
def sum_dict_values(my_dict: dict) -> int:
    pass

"""
Напишите функцию на Python, чтобы получить
максимальное и минимальное (в указанной последовательности) значение в словаре. 
"""
from typing import List


def max_min_dict(my_dict: dict) -> List[int]:
    pass

"""
Даны два словаря: dictionary_1 = {'a': 300, 'b': 400} и dictionary_2 = {'c': 500, 'd': 600}.
Объедините их в один при помощи встроенных функций языка Python.
"""
def dict_union(dict1: dict, dict2: dict) -> dict:
    pass

"""
Дан словарь с числовыми значениями. Необходимо их все перемножить и вывести на экран.
data = {'data1': 375, 'data2': 567, 'data3': -37, 'data4': 21}
"""
def mutiply_dict_values(my_dict: dict) -> int:
    pass

"""
* Создайте словарь из строки 'pythonist' следующим образом: в качестве ключей возьмите буквы строки,
а значениями пусть будут числа, соответствующие количеству вхождений данной буквы в строку.
"""
def count_letters(string: str) -> dict:
    pass

"""
** Дан список элементов [1, 2, 3, 4, 4, 1, 3, 4, 5, 5, 5, 5]. 
Необходимо написать функцию, которая будет возвращать словарь, где ключом является элемент списка, 
а значением - его количество в этом списке.
# """
def dict_from_list(given_list: list) -> dict:
    pass