print("Task 1")
# x1, x2 = int(input("Введите первое целое число ")), int(input("Введите второе целое число "))
# if x1 > x2:
#     print(f"Это число: {x2} было меньше")
# elif x2 > x1:
#     print(f"Это число: {x1} было меньше")
# else:
#     print("Числа были равны")
    
# print("Task 2")
# name, age = str(input("Введите имя ")), int(input("Введите возраст "))
# if age >= 18:
#     print(f"Добрый вечер, {name.capitalize()}! Вы совершеннолетний, поздравляем!")
# else:
#     print(f"Привет, {name.capitalize()}! Приносим извинения, но вы не можете гулять после 22:00")
    
# print("Task 3")
# y1, y2, y3 = int(input("Введите первое число ")), int(input("Введите второе число ")), int(input("Введите третье число "))
# if y1==y2:
#     print(f'Ваше число: {y3}, которое не равно другим')
# elif y2==y3:
#     print(f'Ваше число: {y1}, которое не равно другим')
# elif y1==y3:
#     print(f'Ваше число: {y2}, которое не равно другим')
# else:
#     print('Ошибка')